<!-- build time:Wed Mar 22 2023 00:57:31 GMT+0800 (中国标准时间) --><!DOCTYPE html><html lang="zh-CN"><head><meta charset="UTF-8"><meta name="viewport" content="width=device-width,initial-scale=1,maximum-scale=2"><meta name="theme-color" content="#FFF"><link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon.png"><link rel="icon" type="image/ico" sizes="32x32" href="/images/favicon.ico"><meta http-equiv="Cache-Control" content="no-transform"><meta http-equiv="Cache-Control" content="no-siteapp"><link rel="alternate" type="application/rss+xml" title="Or0kit" href="https://or0kit.github.io/rss.xml"><link rel="alternate" type="application/atom+xml" title="Or0kit" href="https://or0kit.github.io/atom.xml"><link rel="alternate" type="application/json" title="Or0kit" href="https://or0kit.github.io/feed.json"><link rel="stylesheet" href="//fonts.googleapis.com/css?family=Mulish:300,300italic,400,400italic,700,700italic%7CFredericka%20the%20Great:300,300italic,400,400italic,700,700italic%7CNoto%20Serif%20JP:300,300italic,400,400italic,700,700italic%7CNoto%20Serif%20SC:300,300italic,400,400italic,700,700italic%7CInconsolata:300,300italic,400,400italic,700,700italic&display=swap&subset=latin,latin-ext"><link rel="stylesheet" href="/css/app.css?v=0.2.5"><meta name="keywords" content="内核空间,内核模块,遍历内核模块,定位未导出函数PspTiminateProcess"><link rel="canonical" href="https://or0kit.github.io/Bin/Core/Drive-Development/%E9%A9%B1%E5%8A%A8%E5%BC%80%E5%8F%91-%E5%86%85%E6%A0%B8%E7%A9%BA%E9%97%B4%E5%92%8C%E5%86%85%E6%A0%B8%E6%A8%A1%E5%9D%97/"><title>驱动开发-内核空间和内核模块 - 驱动开发 - 内核学习 - 逆向 | Or0kit = Or0kit</title><meta name="generator" content="Hexo 5.3.0"></head><body itemscope itemtype="http://schema.org/WebPage"><div id="loading"><div class="cat"><div class="body"></div><div class="head"><div class="face"></div></div><div class="foot"><div class="tummy-end"></div><div class="bottom"></div><div class="legs left"></div><div class="legs right"></div></div><div class="paw"><div class="hands left"></div><div class="hands right"></div></div></div></div><div id="container"><header id="header" itemscope itemtype="http://schema.org/WPHeader"><div class="inner"><div id="brand"><div class="pjax"><h1 itemprop="name headline">驱动开发-内核空间和内核模块</h1><div class="meta"><span class="item" title="创建时间：2021-09-24 23:53:44"><span class="icon"><i class="ic i-calendar"></i> </span><span class="text">发表于</span> <time itemprop="dateCreated datePublished" datetime="2021-09-24T23:53:44+08:00">2021-09-24</time> </span><span class="item" title="本文字数"><span class="icon"><i class="ic i-pen"></i> </span><span class="text">本文字数</span> <span>10k</span> <span class="text">字</span> </span><span class="item" title="阅读时长"><span class="icon"><i class="ic i-clock"></i> </span><span class="text">阅读时长</span> <span>9 分钟</span></span></div></div></div><nav id="nav"><div class="inner"><div class="toggle"><div class="lines" aria-label="切换导航栏"><span class="line"></span> <span class="line"></span> <span class="line"></span></div></div><ul class="menu"><li class="item title"><a href="/" rel="start">Or0kit</a></li></ul><ul class="right"><li class="item theme"><i class="ic i-sun"></i></li><li class="item search"><i class="ic i-search"></i></li></ul></div></nav></div><div id="imgs" class="pjax"><ul><li class="item" data-background-image="http://storage.live.com/items/70930153B02A575!386?authkey=AGDHHD5Qh4Y5OtQ"></li><li class="item" data-background-image="http://storage.live.com/items/70930153B02A575!364?authkey=AGDHHD5Qh4Y5OtQ"></li><li class="item" data-background-image="http://storage.live.com/items/70930153B02A575!291?authkey=AGDHHD5Qh4Y5OtQ"></li><li class="item" data-background-image="http://storage.live.com/items/70930153B02A575!296?authkey=AGDHHD5Qh4Y5OtQ"></li><li class="item" data-background-image="http://storage.live.com/items/70930153B02A575!393?authkey=AGDHHD5Qh4Y5OtQ"></li><li class="item" data-background-image="http://storage.live.com/items/70930153B02A575!385?authkey=AGDHHD5Qh4Y5OtQ"></li></ul></div></header><div id="waves"><svg class="waves" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" viewBox="0 24 150 28" preserveAspectRatio="none" shape-rendering="auto"><defs><path id="gentle-wave" d="M-160 44c30 0 58-18 88-18s 58 18 88 18 58-18 88-18 58 18 88 18 v44h-352z"/></defs><g class="parallax"><use xlink:href="#gentle-wave" x="48" y="0"/><use xlink:href="#gentle-wave" x="48" y="3"/><use xlink:href="#gentle-wave" x="48" y="5"/><use xlink:href="#gentle-wave" x="48" y="7"/></g></svg></div><main><div class="inner"><div id="main" class="pjax"><div class="article wrap"><div class="breadcrumb" itemscope itemtype="https://schema.org/BreadcrumbList"><i class="ic i-home"></i> <span><a href="/">首页</a></span><i class="ic i-angle-right"></i> <span itemprop="itemListElement" itemscope itemtype="https://schema.org/ListItem"><a href="/categories/Bin/" itemprop="item" rel="index" title="分类于 逆向"><span itemprop="name">逆向</span></a><meta itemprop="position" content="1"></span><i class="ic i-angle-right"></i> <span itemprop="itemListElement" itemscope itemtype="https://schema.org/ListItem"><a href="/categories/Bin/Core/" itemprop="item" rel="index" title="分类于 内核学习"><span itemprop="name">内核学习</span></a><meta itemprop="position" content="2"></span><i class="ic i-angle-right"></i> <span class="current" itemprop="itemListElement" itemscope itemtype="https://schema.org/ListItem"><a href="/categories/Bin/Core/Drive-Development/" itemprop="item" rel="index" title="分类于 驱动开发"><span itemprop="name">驱动开发</span></a><meta itemprop="position" content="3"></span></div><article itemscope itemtype="http://schema.org/Article" class="post block" lang="zh-CN"><link itemprop="mainEntityOfPage" href="https://or0kit.github.io/Bin/Core/Drive-Development/%E9%A9%B1%E5%8A%A8%E5%BC%80%E5%8F%91-%E5%86%85%E6%A0%B8%E7%A9%BA%E9%97%B4%E5%92%8C%E5%86%85%E6%A0%B8%E6%A8%A1%E5%9D%97/"><span hidden itemprop="author" itemscope itemtype="http://schema.org/Person"><meta itemprop="image" content="/images/avatar.jpg"><meta itemprop="name" content="Or0kit"><meta itemprop="description" content=", 临渊羡鱼，不如退而结网"></span><span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization"><meta itemprop="name" content="Or0kit"></span><div class="body md" itemprop="articleBody"><h1 id="内核空间"><a class="anchor" href="#内核空间">#</a> 内核空间</h1><p>每个进程的低 2G 都是独立的，它们所对应的物理页都是不一样的，而高 2G 所对应的物理页都是相同的。</p><p>概念图:</p><p><img data-src="image001.png" alt=""></p><h2 id="实验验证"><a class="anchor" href="#实验验证">#</a> 实验验证</h2><p>写一个驱动程序定义一个全局变量，在不同进程中查看。</p><figure class="highlight c"><figcaption data-lang="c"></figcaption><table><tr><td data-num="1"></td><td><pre><span class="token macro property"><span class="token directive-hash">#</span><span class="token directive keyword">include</span><span class="token string">&lt;ntddk.h></span></span></pre></td></tr><tr><td data-num="2"></td><td><pre></pre></td></tr><tr><td data-num="3"></td><td><pre>ULONG g_Value <span class="token operator">=</span> <span class="token number">0x12345678</span><span class="token punctuation">;</span></pre></td></tr><tr><td data-num="4"></td><td><pre></pre></td></tr><tr><td data-num="5"></td><td><pre>VOID <span class="token function">DriverUnload</span><span class="token punctuation">(</span>PDRIVER_OBJECT pdriver<span class="token punctuation">)</span> <span class="token punctuation">&#123;</span></pre></td></tr><tr><td data-num="6"></td><td><pre>	<span class="token function">DbgPrint</span><span class="token punctuation">(</span><span class="token string">"我是驱动，我卸载了\n"</span><span class="token punctuation">)</span><span class="token punctuation">;</span></pre></td></tr><tr><td data-num="7"></td><td><pre><span class="token punctuation">&#125;</span></pre></td></tr><tr><td data-num="8"></td><td><pre></pre></td></tr><tr><td data-num="9"></td><td><pre>NTSTATUS <span class="token function">DriverEntry</span><span class="token punctuation">(</span>PDRIVER_OBJECT pdriver<span class="token punctuation">,</span> PUNICODE_STRING reg_path<span class="token punctuation">)</span> <span class="token punctuation">&#123;</span></pre></td></tr><tr><td data-num="10"></td><td><pre>	<span class="token function">DbgPrint</span><span class="token punctuation">(</span><span class="token string">"我是驱动我运行了\n"</span><span class="token punctuation">)</span><span class="token punctuation">;</span></pre></td></tr><tr><td data-num="11"></td><td><pre>	<span class="token function">DbgPrint</span><span class="token punctuation">(</span><span class="token string">"%p\n"</span><span class="token punctuation">,</span> <span class="token operator">&amp;</span>g_Value<span class="token punctuation">)</span><span class="token punctuation">;</span></pre></td></tr><tr><td data-num="12"></td><td><pre>	pdriver<span class="token operator">-></span>DriverUnload <span class="token operator">=</span> DriverUnload<span class="token punctuation">;</span></pre></td></tr><tr><td data-num="13"></td><td><pre>	<span class="token keyword">return</span> STATUS_SUCCESS<span class="token punctuation">;</span></pre></td></tr><tr><td data-num="14"></td><td><pre><span class="token punctuation">&#125;</span></pre></td></tr></table></figure><p><img data-src="image002.png" alt=""><br><img data-src="image003.png" alt=""></p><h1 id="内核模块"><a class="anchor" href="#内核模块">#</a> 内核模块</h1><p>硬件的种类繁多，不可能做一个兼容所有硬件的内核，因此，微软提供规定的接口格式，让硬件驱动人员按照规定的格式编写 “驱动程序”<br>这些驱动程序每一个都是一个模块，称为 “内核模块”，可以加载到内核中，并遵守 PE 结构。但本质上讲，任意一个.sys 文件与内核文件没有区别<br>不管是我们自己编写的 .sys 文件，还是 Windows 自带的内核文件（如 ntoskrnl.exe），它们在内核中的地位是相同的，都是内核模块中的其中一个</p><p><img data-src="image004.png" alt=""></p><h1 id="驱动对象"><a class="anchor" href="#驱动对象">#</a> 驱动对象</h1><h2 id="_driver_object结构体"><a class="anchor" href="#_driver_object结构体">#</a> <code>_DRIVER_OBJECT</code> 结构体</h2><pre><code>kd&gt; dt _DRIVER_OBJECT
nt!_DRIVER_OBJECT
  +0x000 Type             : Int2B
  +0x002 Size             : Int2B
  +0x004 DeviceObject     : Ptr32 _DEVICE_OBJECT
  +0x008 Flags            : Uint4B
  +0x00c DriverStart      : Ptr32 Void
  +0x010 DriverSize       : Uint4B
  +0x014 DriverSection    : Ptr32 Void
  +0x018 DriverExtension  : Ptr32 _DRIVER_EXTENSION
  +0x01c DriverName       : _UNICODE_STRING
  +0x024 HardwareDatabase : Ptr32 _UNICODE_STRING
  +0x028 FastIoDispatch   : Ptr32 _FAST_IO_DISPATCH
  +0x02c DriverInit       : Ptr32     long 
  +0x030 DriverStartIo    : Ptr32     void 
  +0x034 DriverUnload     : Ptr32     void 
  +0x038 MajorFunction    : [28] Ptr32     long 
</code></pre><p>其中对我们来说比较重要的结构:<br><code>DriverStart：</code> 驱动模块在内核中的地址<br><code>DriverSize：</code> 驱动模块在内核中的大小<br><code>DriverName：</code> 驱动模块在内核中的名字<br><code>DriverSection：</code> 指向 <code>_LDR_DATA_TABLE_ENTRY</code> 结构体</p><h2 id="_ldr_data_table_entry-结构体"><a class="anchor" href="#_ldr_data_table_entry-结构体">#</a> <code>_LDR_DATA_TABLE_ENTRY</code> 结构体</h2><p>描述：包含了当前内核模块的具体信息，以及其它内核模块的双向链表。</p><pre><code>kd&gt; dt _LDR_DATA_TABLE_ENTRY
nt!_LDR_DATA_TABLE_ENTRY
  +0x000 InLoadOrderLinks : _LIST_ENTRY
  +0x008 InMemoryOrderLinks : _LIST_ENTRY
  +0x010 InInitializationOrderLinks : _LIST_ENTRY
  +0x018 DllBase          : Ptr32 Void
  +0x01c EntryPoint       : Ptr32 Void
  +0x020 SizeOfImage      : Uint4B
  +0x024 FullDllName      : _UNICODE_STRING
  +0x02c BaseDllName      : _UNICODE_STRING
  +0x034 Flags            : Uint4B
  +0x038 LoadCount        : Uint2B
  +0x03a TlsIndex         : Uint2B
  +0x03c HashLinks        : _LIST_ENTRY
  +0x03c SectionPointer   : Ptr32 Void
  +0x040 CheckSum         : Uint4B
  +0x044 TimeDateStamp    : Uint4B
  +0x044 LoadedImports    : Ptr32 Void
  +0x048 EntryPointActivationContext : Ptr32 Void
  +0x04c PatchInformation : Ptr32 Void
</code></pre><p>和 3 环有点区别，在 0 环中 <code>InMemoryOrderLinks</code> 和 <code>InInitializationOrderLinks</code> 是没用的，只需要关注第一个链表 <code>InLoadOrderLinks</code> 。</p><p><code>_LIST_ENTRY</code> 这个结构体存了两个地址，指向前一个节点和下一个节点。</p><pre><code>kd&gt; dt _LIST_ENTRY
ntdll!_LIST_ENTRY
  +0x000 Flink            : Ptr32 _LIST_ENTRY
  +0x004 Blink            : Ptr32 _LIST_ENTRY
