<?xml version="1.0"?>
<rss version="2.0">
    <channel>
        <title>Or0kit • Posts by &#34;内核模块&#34; tag</title>
        <link>https://Or0kit.github.io</link>
        <description>临渊羡鱼，不如退而结网</description>
        <language>zh-CN</language>
        <pubDate>Fri, 24 Sep 2021 23:53:44 +0800</pubDate>
        <lastBuildDate>Fri, 24 Sep 2021 23:53:44 +0800</lastBuildDate>
        <category>Drozer</category>
        <category>Algolia</category>
        <category>同义词替换</category>
        <category>xpath</category>
        <category>win32api</category>
        <category>WOW64</category>
        <category>windows消息机制</category>
        <category>虚拟内存</category>
        <category>jsDelivr</category>
        <category>First blog</category>
        <category>markdown 学习</category>
        <category>Android</category>
        <category>替换密钥</category>
        <category>数论基础</category>
        <category>ADB</category>
        <category>雷电模拟器</category>
        <category>Hadoop</category>
        <category>IDA</category>
        <category>Windows逆向</category>
        <category>SSH隧道</category>
        <category>url</category>
        <category>http</category>
        <category>Nginx</category>
        <category>Linux</category>
        <category>CentOS7配置vsftp</category>
        <category>Psad</category>
        <category>fwsnort</category>
        <category>应急响应</category>
        <category>x86汇编指令</category>
        <category>逆向</category>
        <category>IDA学习</category>

&lt;figure class=&#34;highlight c&#34;&gt;&lt;figcaption data-lang=&#34;c&#34;&gt;&lt;/figcaption&gt;&lt;table&gt;&lt;tr&gt;&lt;td data-num=&#34;1&#34;&gt;&lt;/td&gt;&lt;td&gt;&lt;pre&gt;&lt;span class=&#34;token macro property&#34;&gt;&lt;span class=&#34;token directive-hash&#34;&gt;#&lt;/span&gt;&lt;span class=&#34;token directive keyword&#34;&gt;include&lt;/span&gt;&lt;span class=&#34;token string&#34;&gt;&amp;lt;ntddk.h&gt;&lt;/span&gt;&lt;/span&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;tr&gt;&lt;td data-num=&#34;2&#34;&gt;&lt;/td&gt;&lt;td&gt;&lt;pre&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;tr&gt;&lt;td data-num=&#34;3&#34;&gt;&lt;/td&gt;&lt;td&gt;&lt;pre&gt;ULONG g_Value &lt;span class=&#34;token operator&#34;&gt;=&lt;/span&gt; &lt;span class=&#34;token number&#34;&gt;0x12345678&lt;/span&gt;&lt;span class=&#34;token punctuation&#34;&gt;;&lt;/span&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;tr&gt;&lt;td data-num=&#34;4&#34;&gt;&lt;/td&gt;&lt;td&gt;&lt;pre&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;tr&gt;&lt;td data-num=&#34;5&#34;&gt;&lt;/td&gt;&lt;td&gt;&lt;pre&gt;VOID &lt;span class=&#34;token function&#34;&gt;DriverUnload&lt;/span&gt;&lt;span class=&#34;token punctuation&#34;&gt;(&lt;/span&gt;PDRIVER_OBJECT pdriver&lt;span class=&#34;token punctuation&#34;&gt;)&lt;/span&gt; &lt;span class=&#34;token punctuation&#34;&gt;&amp;#123;&lt;/span&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;tr&gt;&lt;td data-num=&#34;6&#34;&gt;&lt;/td&gt;&lt;td&gt;&lt;pre&gt;	&lt;span class=&#34;token function&#34;&gt;DbgPrint&lt;/span&gt;&lt;span class=&#34;token punctuation&#34;&gt;(&lt;/span&gt;&lt;span class=&#34;token string&#34;&gt;&#34;我是驱动，我卸载了\n&#34;&lt;/span&gt;&lt;span class=&#34;token punctuation&#34;&gt;)&lt;/span&gt;&lt;span class=&#34;token punctuation&#34;&gt;;&lt;/span&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;tr&gt;&lt;td data-num=&#34;7&#34;&gt;&lt;/td&gt;&lt;td&gt;&lt;pre&gt;&lt;span class=&#34;token punctuation&#34;&gt;&amp;#125;&lt;/span&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;tr&gt;&lt;td data-num=&#34;8&#34;&gt;&lt;/td&gt;&lt;td&gt;&lt;pre&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;tr&gt;&lt;td data-num=&#34;9&#34;&gt;&lt;/td&gt;&lt;td&gt;&lt;pre&gt;NTSTATUS &lt;span class=&#34;token function&#34;&gt;DriverEntry&lt;/span&gt;&lt;span class=&#34;token punctuation&#34;&gt;(&lt;/span&gt;PDRIVER_OBJECT pdriver&lt;span class=&#34;token punctuation&#34;&gt;,&lt;/span&gt; PUNICODE_STRING reg_path&lt;span class=&#34;token punctuation&#34;&gt;)&lt;/span&gt; &lt;span class=&#34;token punctuation&#34;&gt;&amp;#123;&lt;/span&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;tr&gt;&lt;td data-num=&#34;10&#34;&gt;&lt;/td&gt;&lt;td&gt;&lt;pre&gt;	&lt;span class=&#34;token function&#34;&gt;DbgPrint&lt;/span&gt;&lt;span class=&#34;token punctuation&#34;&gt;(&lt;/span&gt;&lt;span class=&#34;token string&#34;&gt;&#34;我是驱动我运行了\n&#34;&lt;/span&gt;&lt;span class=&#34;token punctuation&#34;&gt;)&lt;/span&gt;&lt;span class=&#34;token punctuation&#34;&gt;;&lt;/span&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;tr&gt;&lt;td data-num=&#34;11&#34;&gt;&lt;/td&gt;&lt;td&gt;&lt;pre&gt;	&lt;span class=&#34;token function&#34;&gt;DbgPrint&lt;/span&gt;&lt;span class=&#34;token punctuation&#34;&gt;(&lt;/span&gt;&lt;span class=&#34;token string&#34;&gt;&#34;%p\n&#34;&lt;/span&gt;&lt;span class=&#34;token punctuation&#34;&gt;,&lt;/span&gt; &lt;span class=&#34;token operator&#34;&gt;&amp;amp;&lt;/span&gt;g_Value&lt;span class=&#34;token punctuation&#34;&gt;)&lt;/span&gt;&lt;span class=&#34;token punctuation&#34;&gt;;&lt;/span&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;tr&gt;&lt;td data-num=&#34;12&#34;&gt;&lt;/td&gt;&lt;td&gt;&lt;pre&gt;	pdriver&lt;span class=&#34;token operator&#34;&gt;-&gt;&lt;/span&gt;DriverUnload &lt;span class=&#34;token operator&#34;&gt;=&lt;/span&gt; DriverUnload&lt;span class=&#34;token punctuation&#34;&gt;;&lt;/span&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;tr&gt;&lt;td data-num=&#34;13&#34;&gt;&lt;/td&gt;&lt;td&gt;&lt;pre&gt;	&lt;span class=&#34;token keyword&#34;&gt;return&lt;/span&gt; STATUS_SUCCESS&lt;span class=&#34;token punctuation&#34;&gt;;&lt;/span&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;tr&gt;&lt;td data-num=&#34;14&#34;&gt;&lt;/td&gt;&lt;td&gt;&lt;pre&gt;&lt;span class=&#34;token punctuation&#34;&gt;&amp;#125;&lt;/span&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;&lt;p&gt;&lt;img data-src=&#34;image002.png&#34; alt=&#34;&#34; /&gt;&lt;br /&gt;
&lt;img data-src=&#34;image003.png&#34; alt=&#34;&#34; /&gt;&lt;/p&gt;
&lt;h1 id=&#34;内核模块&#34;&gt;&lt;a class=&#34;anchor&#34; href=&#34;#内核模块&#34;&gt;#&lt;/a&gt; 内核模块&lt;/h1&gt;
&lt;p&gt;硬件的种类繁多，不可能做一个兼容所有硬件的内核，因此，微软提供规定的接口格式，让硬件驱动人员按照规定的格式编写 “驱动程序”&lt;br /&gt;
 这些驱动程序每一个都是一个模块，称为 “内核模块”，可以加载到内核中，并遵守 PE 结构。但本质上讲，任意一个.sys 文件与内核文件没有区别&lt;br /&gt;
不管是我们自己编写的 .sys 文件，还是 Windows 自带的内核文件（如 ntoskrnl.exe），它们在内核中的地位是相同的，都是内核模块中的其中一个&lt;/p&gt;
&lt;p&gt;&lt;img data-src=&#34;image004.png&#34; alt=&#34;&#34; /&gt;&lt;/p&gt;
&lt;h1 id=&#34;驱动对象&#34;&gt;&lt;a class=&#34;anchor&#34; href=&#34;#驱动对象&#34;&gt;#&lt;/a&gt; 驱动对象&lt;/h1&gt;
&lt;h2 id=&#34;_driver_object结构体&#34;&gt;&lt;a class=&#34;anchor&#34; href=&#34;#_driver_object结构体&#34;&gt;#&lt;/a&gt;  &lt;code&gt;_DRIVER_OBJECT&lt;/code&gt;  结构体&lt;/h2&gt;
&lt;pre&gt;&lt;code&gt;kd&amp;gt; dt _DRIVER_OBJECT
nt!_DRIVER_OBJECT
  +0x000 Type             : Int2B
  +0x002 Size             : Int2B
  +0x004 DeviceObject     : Ptr32 _DEVICE_OBJECT
  +0x008 Flags            : Uint4B
  +0x00c DriverStart      : Ptr32 Void
  +0x010 DriverSize       : Uint4B
  +0x014 DriverSection    : Ptr32 Void
  +0x018 DriverExtension  : Ptr32 _DRIVER_EXTENSION
  +0x01c DriverName       : _UNICODE_STRING
  +0x024 HardwareDatabase : Ptr32 _UNICODE_STRING
  +0x028 FastIoDispatch   : Ptr32 _FAST_IO_DISPATCH
  +0x02c DriverInit       : Ptr32     long 
  +0x030 DriverStartIo    : Ptr32     void 
  +0x034 DriverUnload     : Ptr32     void 
  +0x038 MajorFunction    : [28] Ptr32     long 
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;其中对我们来说比较重要的结构:&lt;br /&gt;
 &lt;code&gt;DriverStart：&lt;/code&gt; 驱动模块在内核中的地址&lt;br /&gt;
 &lt;code&gt;DriverSize：&lt;/code&gt; 驱动模块在内核中的大小&lt;br /&gt;
 &lt;code&gt;DriverName：&lt;/code&gt; 驱动模块在内核中的名字&lt;br /&gt;
 &lt;code&gt;DriverSection：&lt;/code&gt; 指向  &lt;code&gt;_LDR_DATA_TABLE_ENTRY&lt;/code&gt;  结构体&lt;/p&gt;
&lt;h2 id=&#34;_ldr_data_table_entry-结构体&#34;&gt;&lt;a class=&#34;anchor&#34; href=&#34;#_ldr_data_table_entry-结构体&#34;&gt;#&lt;/a&gt;  &lt;code&gt;_LDR_DATA_TABLE_ENTRY&lt;/code&gt;  结构体&lt;/h2&gt;
&lt;p&gt;描述：包含了当前内核模块的具体信息，以及其它内核模块的双向链表。&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;kd&amp;gt; dt _LDR_DATA_TABLE_ENTRY
nt!_LDR_DATA_TABLE_ENTRY
  +0x000 InLoadOrderLinks : _LIST_ENTRY
  +0x008 InMemoryOrderLinks : _LIST_ENTRY
  +0x010 InInitializationOrderLinks : _LIST_ENTRY
  +0x018 DllBase          : Ptr32 Void
  +0x01c EntryPoint       : Ptr32 Void
  +0x020 SizeOfImage      : Uint4B
  +0x024 FullDllName      : _UNICODE_STRING
  +0x02c BaseDllName      : _UNICODE_STRING
  +0x034 Flags            : Uint4B
  +0x038 LoadCount        : Uint2B
  +0x03a TlsIndex         : Uint2B
  +0x03c HashLinks        : _LIST_ENTRY
  +0x03c SectionPointer   : Ptr32 Void
  +0x040 CheckSum         : Uint4B
  +0x044 TimeDateStamp    : Uint4B
  +0x044 LoadedImports    : Ptr32 Void
  +0x048 EntryPointActivationContext : Ptr32 Void
  +0x04c PatchInformation : Ptr32 Void
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;和 3 环有点区别，在 0 环中  &lt;code&gt;InMemoryOrderLinks&lt;/code&gt;  和  &lt;code&gt;InInitializationOrderLinks&lt;/code&gt;  是没用的，只需要关注第一个链表  &lt;code&gt;InLoadOrderLinks&lt;/code&gt; 。&lt;/p&gt;
&lt;p&gt;&lt;code&gt;_LIST_ENTRY&lt;/code&gt;  这个结构体存了两个地址，指向前一个节点和下一个节点。&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;kd&amp;gt; dt _LIST_ENTRY
ntdll!_LIST_ENTRY
  +0x000 Flink            : Ptr32 _LIST_ENTRY
  +0x004 Blink            : Ptr32 _LIST_ENTRY
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;比较重要的结构:&lt;br /&gt;
 &lt;code&gt;InLoadOrderLinks：&lt;/code&gt; 双向链表，包含所有内核模块&lt;br /&gt;
 &lt;code&gt;DllBase：&lt;/code&gt; 当前内核模块起始地址&lt;br /&gt;
 &lt;code&gt;SizeOfImage：&lt;/code&gt; 当前内核模块的大小&lt;br /&gt;
 &lt;code&gt;FullDllName：&lt;/code&gt; 当前内核模块的完整路径&lt;br /&gt;
 &lt;code&gt;BaseDllName：&lt;/code&gt; 当前内核模块的模块名&lt;/p&gt;
&lt;h2 id=&#34;遍历内核模块&#34;&gt;&lt;a class=&#34;anchor&#34; href=&#34;#遍历内核模块&#34;&gt;#&lt;/a&gt; 遍历内核模块&lt;/h2&gt;
&lt;p&gt;我们可以发现，我们可以由一个内核模块遍历处所有的内核模块。&lt;/p&gt;
&lt;p&gt;通过这个  &lt;code&gt;InLoadOrderLinks&lt;/code&gt; ，我们可以遍历整个高 2G 的模块了。 &lt;code&gt;InLoadOrderLinks.Flink&lt;/code&gt;  指向的就是下一个  &lt;code&gt;_LDR_DATA_TABLE_ENTRY&lt;/code&gt; 。&lt;/p&gt;
